//===-- yeti/core/misc/xml.h ------------------------------*- mode: C99 -*-===//
//
//                            __ __ _____ __
//                           |  |  |     |  |
//                           |-   -| | | |  |__
//                           |__|__|_|_|_|_____|
//
//       This file is distributed under the terms described in LICENSE.
//          https://github.com/origamicomet/xml/blob/master/LICENSE
//
//===----------------------------------------------------------------------===//

/* This file provides both the interface and the implementation!
 *
 * To instantiate the implementation, define  XML_IMPLEMENTATION in *one*
 * source file, before including this file. Alternatively, you can link to the
 * convience library that does this for you.
 */

#ifndef XML_H
#define XML_H

#if defined(_MSC_VER)
  #define XML_ON_MSVC  1
  #define XML_ON_CLANG 0
  #define XML_ON_GCC   0
#elif defined(__GNUC__)
  #if defined(__clang__)
    #define XML_ON_MSVC  0
    #define XML_ON_CLANG 1
    #define XML_ON_GCC   1
  #else
    /* HACK(mtwilliams): We assume that we're being compiled with GCC. */
    #define XML_ON_MSVC  0
    #define XML_ON_CLANG 0
    #define XML_ON_GCC   1
  #endif
#endif

#if defined(_WIN32) || defined(_WIN64)
  #define XML_ON_WINDOWS 1
  #define XML_ON_MAC 0
  #define XML_ON_LINUX 0
  #define XML_ON_ANDROID 0
  #define XML_ON_IOS 0
#elif defined(__APPLE__)
  #include <TargetConditionals.h>
  #if TARGET_OS_MAC
    #define XML_ON_WINDOWS 0

    #define XML_ON_IOS 1
  #elif TARGET_OS_TVOS
    /* Realistically, we could support tvOS... */
    #error ("We don't support tvOS!")
  #else
    #error ("We don't support this platform!")
  #endif
#elif defined(__linux__)
  #if defined(ANDROID)
    #define XML_ON_WINDOWS 0
    #define XML_ON_MAC 0
    #define XML_ON_LINUX 0
    #define XML_ON_ANDROID 1
    #define XML_ON_IOS 0
  #else
    #define XML_ON_WINDOWS 0
    #define XML_ON_MAC 0
    #define XML_ON_LINUX 1
    #define XML_ON_ANDROID 0
    #define XML_ON_IOS 0
  #endif
#else
  #error ("We don't support this platform!")
#endif

#if XML_ON_WINDOWS
  #define XML_ON_POSIX 0
#elif XML_ON_MAC || XML_ON_LINUX
  #define XML_ON_POSIX 1
#elif XML_ON_ANDROID || XML_ON_IOS
  /* Ostensibly... */
  #define XML_ON_POSIX 1
#endif

#if defined(_M_IX86) || defined(__i386__)
  #define XML_ON_X86 1
  #define XML_ON_X86_64 0
#elif defined(_M_X64) || defined(__x86_64__)
  #define XML_ON_X86 0
  #define XML_ON_X86_64 1
#endif

#if XML_ON_WINDOWS
  #define XML_EXPORT(Return) Return __stdcall
  #define XML_CALLBACK(Return) Return __cdecl
#elif XML_ON_MAC
  #define XML_EXPORT(Return) Return
  #define XML_CALLBACK(Return) Return
#elif XML_ON_LINUX
  #define XML_EXPORT(Return) Return
  #define XML_CALLBACK(Return) Return
#elif XML_ON_ANDROID
  #define XML_EXPORT(Return) Return
  #define XML_CALLBACK(Return) Return
#elif XML_ON_IOS
  #define XML_EXPORT(Return) Return
  #define XML_CALLBACK(Return) Return
#endif

#if defined(__cplusplus)
  #define XML_BEGIN_EXTERN_C extern "C" {
  #define XML_END_EXTERN_C }
#else
  #define XML_BEGIN_EXTERN_C
  #define XML_END_EXTERN_C
#endif

XML_BEGIN_EXTERN_C

typedef signed char    xml_int8_t;
typedef unsigned char  xml_uint8_t;
typedef signed short   xml_int16_t;
typedef unsigned short xml_uint16_t;
typedef signed int     xml_int32_t;
typedef unsigned int   xml_uint32_t;

#if defined(_MSC_VER)
  typedef signed __int64 xml_int64_t;
  typedef unsigned __int64 xml_uint64_t;
#else
  typedef signed long long xml_int64_t;
  typedef unsigned long long xml_uint64_t;
#endif

#if (_MSC_VER >= 1300 && _Wp64)
  #if XML_ON_X86
    typedef __w64 signed long xml_intptr_t;
    typedef __w64 unsigned long xml_uintptr_t;
    typedef __w64 unsigned long xml_size_t;
  #elif XML_ON_X86_64
    typedef __w64 signed __int64 xml_intptr_t;
    typedef __w64 unsigned __int64 xml_uintptr_t;
    typedef __w64 unsigned __int64 xml_size_t;
  #endif
#else
  #if XML_ON_X86
    typedef xml_int32_t xml_intptr_t;
    typedef xml_uint32_t xml_uintptr_t;
    typedef xml_uint32_t xml_size_t;
  #elif XML_ON_X86_64
    typedef xml_int64_t xml_intptr_t;
    typedef xml_uint64_t xml_uintptr_t;
    typedef xml_uint64_t xml_size_t;
  #endif
#endif

/* This will cause a negative subscript error if the sizes of our types don't
   match our expectations. */
#define XML_CHECK_SIZE_OF_TYPE(expression) \
  typedef char xml__size_matches_expectation[(expression) ? 1 : -1]

/* Ensure fixed-width types match our expectations. */
XML_CHECK_SIZE_OF_TYPE(sizeof(xml_int8_t)   == 1);
XML_CHECK_SIZE_OF_TYPE(sizeof(xml_uint8_t)  == 1);
XML_CHECK_SIZE_OF_TYPE(sizeof(xml_int16_t)  == 2);
XML_CHECK_SIZE_OF_TYPE(sizeof(xml_uint16_t) == 2);
XML_CHECK_SIZE_OF_TYPE(sizeof(xml_int32_t)  == 4);
XML_CHECK_SIZE_OF_TYPE(sizeof(xml_uint32_t) == 4);
XML_CHECK_SIZE_OF_TYPE(sizeof(xml_int64_t)  == 8);
XML_CHECK_SIZE_OF_TYPE(sizeof(xml_uint64_t) == 8);

/* Ensure pointer-width integer types can actually hold pointers. */
XML_CHECK_SIZE_OF_TYPE(sizeof(xml_intptr_t) == sizeof(void *));
XML_CHECK_SIZE_OF_TYPE(sizeof(xml_uintptr_t) == sizeof(void *));

#undef XML_CHECK_SIZE_OF_TYPE

/* PERF(mtwilliams): Restrict (and aliasing) hints. */
/* TODO(mtwilliams): Better error handling. */

/* Callback event types. */
typedef enum xml_event {
  XML_ELEMENT_BEGIN = 1, /* Element begin. */
  XML_ELEMENT_END   = 2, /* Element end. */
  XML_ATTRIBUTE     = 3  /* Element attribute. */
} xml_event_t;

/* Reference to fragment of input. */
typedef struct {
  const char *s; /* Pointer to fragment. */
  xml_size_t l;  /* Length of fragment, as we don't mutate input. */
} xml_fragment_t;

/* Signature of the callback you pass to the parser. You should return zero to
 * continue parsing or any other value to halt (which results in XML_EUSER). */
typedef XML_CALLBACK(int)
  xml_callback_fn(/* Event type. */
